Repository: schibsted/account-sdk-ios
Catalog: Source/UI/Resources/*.lproj/Localizable.strings
Languages: fi, nb, sv

# GlobalString.platformName
source: Schibsted account
fi: Schibsted-tili
nb: Schibsted-konto
sv: Schibsted-konto

# GlobalString.done
source: Continue
fi: Jatka
nb: Fortsett
sv: Fortsätt

# GlobalString.loading
source: Loading...
fi: Sisältöä...
nb: Laster...
sv: Laddar...

# InfoString.rememberMe
source: We will store information about your session on your device to keep you logged in. â€¨You can change this option later by logging out.
fi: Tallennamme tietoa istunnostasi sinun laitteellesi, jotta voit pysyä kirjautuneena. Voit muuttaa asetusta myöhemmin kirjautumalla ulos.
nb: Vi plasserer en informasjonskapsel på enheten din for å holde deg logget inn. Du kan endre dette alternativet senere, ved å logge deg ut eller slette informasjonskapselen.
sv: Vi kommer att spara information från din session på din enhet så att du kan förbli inloggad. Du kan ändra detta senare genom att logga ut.

# IdentifierScreenString.title.sms
source: Log in or create account
fi: Kirjaudu sisään tai luo tili
nb: Logg inn eller opprett konto
sv: Logga in eller skapa konto

# IdentifierScreenString.title.email
source: Log in or create account
fi: Kirjaudu sisään tai luo tili
nb: Logg inn eller opprett konto
sv: Logga in eller skapa konto

# IdentifierScreenString.inputTitle.phone
source: Enter your phone number
fi: Kirjoita puhelinnumerosi
nb: Skriv inn din telefonnummer
sv: Ange ditt telefonnummer

# IdentifierScreenString.inputTitle.email
source: Enter your email address
fi: Anna sähköpostiosoitteesi
nb: Skriv inn din e-postadresse
sv: Ange din e-postadress

# IdentifierScreenString.inputTitle.password
source: Enter your email address
fi: Anna sähköpostiosoitteesi
nb: Skriv inn din e-postadresse
sv: Ange din e-postadress

# IdentifierScreenString.infoText.internal
source: $0 is part of the Schibsted family.
fi: $0 on osa Schibsted-konsernia.
nb: $0 er en del av Schibsted.
sv: $0 är en del av Schibsted.

# IdentifierScreenString.infoText.external
source: $0 collaborates with Schibsted.
fi: $0 on Schibsted-yhteistyökumppani.
nb: $0 er i samarbeid med Schibsted.
sv: $0 samarbetar med Schibsted.

# IdentifierScreenString.infoText.rest
source: You'll need a Schibsted account to continue. You can use this account across all Schibsted sites.
fi: Jatkaaksesi tarvitset Schibsted-tilin. Voit käyttää samaa tiliä kaikilla Schibsted-sivustoilla.
nb: Du trenger en Schibsted-konto for å fortsette. Du kan bruke denne kontoen på alle Schibsted-sider.
sv: Du behöver ett Schibsted-konto för att fortsätta. Du kan använda samma konto på alla Schibsteds webbplatser.

# IdentifierScreenString.whatsThis
source: What is a Schibsted account?
fi: Mikä Schibsted-tili on?
nb: Hva er en Schibsted-konto?
sv: Vad är ett Schibsted-konto?

# IdentifierScreenString.proceed
source: Continue
fi: Jatka
nb: Fortsett
sv: Fortsätt

# IdentifierScreenString.skip
source: Skip
fi: hypätä yli
nb: Hopp over
sv: Hoppa över

# PasswordScreenString.title.signin
source: Welcome back
fi: Tervetuloa takaisin
nb: Velkommen tilbake
sv: Välkommen tillbaka

# PasswordScreenString.title.signup
source: Create account
fi: Luo tili
nb: Opprett konto
sv: Skapa konto

# PasswordScreenString.inputTitle
source: Enter your password
fi: Kirjoita salasanasi
nb: Vennligst oppgi passordet ditt
sv: Ange ditt lösenord

# PasswordScreenString.proceed
source: Continue
fi: Jatka
nb: Fortsett
sv: Fortsätt

# PasswordScreenString.invalidPassword
source: The password you entered is incorrect. Please try again.
fi: Syöttämäsi salasana on virheellinen. Yritä uudelleen.
nb: Passordet du oppga er feil. Vennligst prøv igjen.
sv: Lösenordet du angav är felaktigt. Försök igen.

# PasswordScreenString.passwordTooShort
source: Your password should have at least 8 characters.
fi: Salasanassa tulee olla vähintään 8 merkkiä.
nb: Passordet ditt skal ha minst 8 tegn.
sv: Ditt lösenord måste ha minst 8 tecken.

# PasswordScreenString.change
source: Not you?
fi: Et sinä?
nb: Ikke deg?
sv: Inte du?

# PasswordScreenString.cancel
source: Cancel
fi: Peruuta
nb: Avbryt
sv: Avbryt

# PasswordScreenString.info
source: Minimum 8 characters
fi: Vähintään 8 merkkiä
nb: Minst 8 tegn
sv: Minst 8 tecken

# PasswordScreenString.forgotPassword
source: Forgot password?
fi: Unohtuiko salasana?
nb: Glemt passord?
sv: Glömt lösenordet?

# PasswordScreenString.persistentLogin
source: Remember me on this device
fi: Muista minut tällä laitteella
nb: Husk meg på denne enheten
sv: Kom ihåg mig på den här enheten

# PasswordScreenString.whatsThis
source: What's this?
fi: Mikä tämä on?
nb: Hva er dette?
sv: Vad är detta?

# PasswordScreenString.ageLimit
source: You need to be at least 15 years old to create a Schibsted account
fi: Sinun tulee olla vähintään 15 vuoden ikäinen, jotta voit luoda Schibsted-tilin
nb: Du må være minst 15 år for å opprette en Schibsted-konto
sv: Du måste vara minst 15 år gammal för att skapa ett Schibsted-konto

# PasswordScreenString.creatingNewAccountNotice
source: You are now creating a new Schibsted account
fi: Olet nyt luomassa uutta Schibsted-tiliä
nb: Du oppretter nå en ny Schibsted-konto
sv: Du skapar nu ett nytt Schibsted-konto

# PasswordScreenString.createAccount
source: Create account
fi: Luo tilit
nb: Opprett konto
sv: Skapa konto

# PasswordScreenString.biometricsPrompt
source: Log in as $0
fi: Kirjaudu sisään $0
nb: Logg inn som $0
sv: Logga in som $0

# PasswordScreenString.touchIdOnboarding.title
source: Would you like to enable Touch ID?
fi: Haluatko aktivoida Touch ID:n?
nb: Vil du aktivere Touch ID?
sv: Vill du aktivera Touch ID?

# PasswordScreenString.touchIdOnboarding.message
source: Log in to $0 with your fingerprint
fi: Kirjaudu $0 sormenjälkitunnistautumisella
nb: Logg inn på $0 med fingeravtrykket ditt
sv: Logga in på $0 med ditt fingeravtryck

# PasswordScreenString.touchIdOnboarding.accept
source: Enable
fi: Aktivoida
nb: Aktivere
sv: Aktivera

# PasswordScreenString.touchIdOnboarding.refuse
source: Not now
fi: Ei nyt
nb: Ikke nå
sv: Inte nu

# VerifyScreenString.title
source: We sent you a code
fi: Koodi on lähetetty sinulle
nb: Vi har sendt deg en kode
sv: Vi har skickat en kod till dig

# VerifyScreenString.subtext
source: Enter the verification code we sent to:
fi: Kirjoita vahvistuskoodi, jonka lähetimme, vastaanottaja:
nb: Tast inn bekreftelseskoden vi sendte til:
sv: Ange verifieringskoden vi skickade till:

# VerifyScreenString.inputTitle
source: Enter your code
fi: Anna koodi
nb: Skriv inn kode
sv: Ange din verifieringskod

# VerifyScreenString.resend
source: Resend the code
fi: Lähetä koodi uudelleen
nb: Send koden igjen
sv: Skicka koden igen

# VerifyScreenString.change
source: Not you?
fi: Et sinä?
nb: Ikke deg?
sv: Inte du?

# VerifyScreenString.proceed
source: Continue
fi: Jatka
nb: Fortsett
sv: Fortsätt

# ResendScreenString.header
source: We sent you a new verification code
fi: Uusi vahvistuskoodi on lähetetty sinulle
nb: Vi har sendt deg en ny bekreftelseskode
sv: Vi har skickat en ny verifieringskod

# ResendScreenString.subtext
source: The code was sent to:
fi: Koodi on lähetetty, vastaanottaja:
nb: Koden ble sendt til:
sv: Koden skickades till:

# ResendScreenString.edit.phone
source: Use a different phone number
fi: Käytä toista puhelinnumeroa
nb: Bruk et annet telefonnummer
sv: Använd ett annat telefonnummer

# ResendScreenString.edit.email
source: Use a different email address
fi: Käytä toista sähköpostiosoitetta
nb: Bruk en annen e-postadresse
sv: Använd en annan e-postadress

# TermsScreenString.title
source: Terms of use
fi: Käyttöehdot
nb: Bruksvilkår
sv: Användarvillkor

# TermsScreenString.subtext.create
source: To create your account, you need to accept the following terms, conditions and privacy policies
fi: Jotta voit luoda tilin, sinun tulee hyväksyä seuraavat käyttöehdot ja tietosuojalausunnot
nb: For å kunne opprette kontoen din, må du godta følgende vilkår, betingelser og personvernerklæringer
sv: För att kunna skapa ett konto måste du godkänna följande användarvillkor och sekretesspolicyer

# TermsScreenString.subtext.login
source: To log in, you need to accept the following terms, conditions and privacy policies
fi: Jotta voit kirjautua tilillesi, sinun tulee hyväksyä seuraavat käyttöehdot ja tietosuojalausunnot
nb: For å logge inn, må du godta følgende vilkår, betingelser og personvernerklæringer
sv: För att kunna logga in måste du godkänna följande användarvillkor och sekretesspolicyer

# TermsScreenString.platform.terms
source: I accept the terms and conditions for $0
fi: Hyväksyn palveluiden $0 käyttöehdot
nb: Jeg godtar vilkårene og betingelsene for $0
sv: Jag godkänner användarvillkoren för $0

# TermsScreenString.client.terms
source: and $0
fi: ja $0
nb: og $0
sv: och $0

# TermsScreenString.platform.privacy
source: I accept the privacy policy for $0
fi: Hyväksyn palveluiden $0 tietosuojalausunnot
nb: Jeg godtar personvernerklæringen for $0
sv: Jag godkänner sekretesspolicyn för $0

# TermsScreenString.client.privacy
source: and $0
fi: ja $0
nb: og $0
sv: och $0

# TermsScreenString.proceed
source: Accept
fi: Hyväksy
nb: Godta
sv: Acceptera

# TermsScreenString.acceptTermError
source: Please accept the terms and conditions to continue.
fi: Jatka hyväksymällä käyttöehdot.
nb: Vennligst godta vilkårene og betingelsene for å fortsette.
sv: Vänligen acceptera användarvillkoren för att fortsätta.

# TermsScreenString.acceptPrivacyError
source: Please accept the privacy policies to continue.
fi: Jatka hyväksymällä tietosuojalausunto.
nb: Vennligst godta personvernerklæringen for å fortsette.
sv: Vänligen acceptera sekretesspolicyn för att fortsätta.

# TermsScreenString.learnMore
source: Learn more about the update
fi: Lisätietoja päivityksestä
nb: Lær mer om oppdateringen
sv: Läs mer om uppdateringen

# TermsSummaryScreenString.title
source: Updated terms and conditions
fi: Päivitetyt käyttöehdot
nb: Oppdaterte brukervilkår og betingelser
sv: Uppdaterade användarvillkoren

# CheckInboxScreenStrings.sentLink
source: We sent a verification link to:
fi: Vahvistuslinkki on lähetetty osoitteeseen:
nb: Vi har sendt enbekreftelseskobling til:
sv: Vi har skickat en verifieringlänk till:

# CheckInboxScreenStrings.change
source: Use a different email address
fi: Käytä toista osoitetta
nb: Bruk en annen e-postadresse
sv: Använd en annan e-postadress

# CheckInboxScreenStrings.title
source: Check your inbox
fi: Tarkista postilaatikkosi
nb: Sjekk innboksen din
sv: Kolla din inkorg

# RequiredFieldsScreenString.title
source: Finalise
fi: Viimeistele
nb: Fullfør
sv: Avsluta

# RequiredFieldsScreenString.subtext
source: We use this information for things like improving our services and giving you relevant ads and content. You can $0 or $1.
fi: Käytämme tietoja esimerkiksi parantamaan palvelujamme ja näyttämään sinulle mielekkäitä mainoksia ja sisältöä. Voit $0 tai $1.
nb: Vi bruker denne informasjonen til for eksempel å forbedre tjenesten vår og gi deg relevant reklame og innhold. Du kan $0, eller $1.
sv: Vi använder de här uppgifterna till exempel för att förbättra våra tjänster och visa dig reklam och innehåll som är relevant för dig. Du kan $0 eller $1.

# RequiredFieldsScreenString.subtext.link0
source: adjust your privacy choices at any time
fi: muuttaa yksityisyysasetuksia milloin hyvänsä
nb: justere personvernvalgene dine når som helst
sv: när som helst ändra dina integritetsval

# RequiredFieldsScreenString.subtext.link1
source: learn more about Schibsted, data and you
fi: lukea lisää Schisbstedistä, tiedoista ja sinusta
nb: finne ut mer om Schibsted, data og deg
sv: läsa mer om Schibsted, data och du

# RequiredFieldsScreenString.proceed
source: Continue
fi: Jatka
nb: Fortsett
sv: Fortsätt

# RequiredField.givenName.title
source: First name
fi: Etunimi
nb: Fornavn
sv: Förnamn

# RequiredField.familyName.title
source: Last name
fi: Sukunimi
nb: Etternavn
sv: Efternamn

# RequiredField.birthday.title
source: Birthday
fi: Syntymäpäivä
nb: Fødselsdag
sv: Födelsedatum

# RequiredField.phoneNumber.title
source: Phone number
fi: Puhelinnumero
nb: Telefonnummer
sv: Telefonnummer

# RequiredField.error.missing
source: This field is required.
fi: Tämä kenttä vaaditaan.
nb: Dette feltet må fylles ut.
sv: Det här fältet måste fyllas i.

# RequiredField.error.lessThanThree
source: This field must be at least 3 characters.
fi: Tässä kentässä tulee olla vähintään 3 merkkiä.
nb: Dette feltet må bestå av minst 3 tegn.
sv: Detta fält måste vara minst 3 tecken

# RequiredField.error.birthdateInvalid
source: This date is invalid.
fi: Tämä päivämäärä on virheellinen.
nb: Denne datoen er ugyldig.
sv: Detta datum är ogiltigt

# RequiredField.error.numberInvalid
source: This number is invalid.
fi: Tämä puhelinnumero on virheellinen.
nb: Dette telefonnummeret er ugyldig.
sv: Detta telefonnummer är ogiltigt.

# ErrorScreenString.heading
source: Something went wrong!
fi: Jokin meni pieleen!
nb: Noe gikk galt!
sv: Någonting gick fel!

# ErrorString.invalidCode
source: Please check your code and try again.
fi: Tarkista koodi ja yritä uudelleen.
nb: Sjekk koden din og prøv igjen.
sv: Kontrollera koden och försök igen.

# ErrorString.invalidPhoneNumber
source: Please enter a valid phone number.
fi: Anna kelvollinen puhelinnumero.
nb: Oppgi et gyldig telefonnummer.
sv: Ange ett giltigt telefonnummer.

# ErrorString.invalidEmail
source: Please enter a valid email address.
fi: Anna kelvollinen sähköpostiosoite.
nb: Oppgi en gyldig e-postadresse.
sv: Ange en giltig e-postadress.

# ErrorString.networkingError
source: We are experiencing problems at the moment. Please try again later.
fi: Ikävä kyllä meillä on tällä hetkellä ongelmia. Yritä myöhemmin uudelleen.
nb: Vi har problemer for øyeblikket. Prøv igjen senere.
sv: Vi har problem för tillfället. Försök igen senare.

# ErrorString.unexpected
source: Please try again later.
fi: Yritä myöhemmin uudelleen.
nb: Prøv igjen senere.
sv: Försök igen senare.

# ErrorString.tooManyRequests
source: You have sent too many code requests. Please try again later.
fi: Olet lähettänyt liian monta koodipyyntöä. Yritä myöhemmin uudelleen.
nb: Du har sendt for mange kodeforespørsler. Prøv igjen senere.
sv: Du har begärt för många koder. Försök igen senare.

# ErrorString.connectionTimeout
source: The connection has timed out. Please try again.
fi: Yhteys on aikakatkaistu. Yritä uudelleen.
nb: Tilkoblingen ble tidsavbrutt. Prøv igjen.
sv: Uppkopplingen avbröts. Försök igen.

# ErrorString.noInternetConnection
source: Unable to connect to the internet. Please check your connection.
fi: Yhteyttä ei voitu muodostaa. Tarkista internetyhteys.
nb: Kan ikke koble til internett. Sjekk tilkoblingen din.
sv: Det gick inte att ansluta till internet. Kontrollera din anslutning.

# ErrorString.unableToResend
source: Unable to resend code. Please try again later.
fi: Koodia ei onnistuttu lähettämään uudelleen. Yritä myöhemmin uudelleen.
nb: Klarte ikke å sende koden på nytt. Prøv igjen senere.
sv: Kan inte skicka om koden. Försök igen senare.
